[
  {
    "title": "Dokáže C3 nahradit C++?",
    "tldr": "Nově vzniklý jazyk C3 nabírá na popularitě. V následujícím článku si jej krátce shrneme a popíšeme.",
    "text": "   Jazyk C3 je procedurální programovací jazyk další generace. Vznikl jako větev projektu C2 od <a href='https://github.com/bvdberg'>Bas van den Berg</a>. Za svůj cíl si vývojáři dali, vytvořit moderní a efektivní náhradu jazyka C. Důraz by měl být kladen na minimalističnost, modulárnsost, efektivitu a kompatibilitu s jazykem C.\n   Dokáže to, ale tento jazyk? Je téměř nemožné si nevšimnout hromady nových programovacích jazyků, které se na nás vrhají. Po úspěchu Rustu, který ukončil dlouholeté prvenství v rychlosti jazyka C, mezi všemi jazyky, se na obzor dostávají nové jako je ZIg či právě C3. \n    Z historie víme, že jazyky častokrát zanikají pod nátlakem své zbytečnosti, to jestli i C3 bude patřit mezi tyto selhání či se z něj stane nový standard, ukáže pouze čas. Ve verzi 1.0 bychom měli být schopni programovat v roce <b>2028</b>.\n\nZdroje:\nhttps://c3-lang.org/getting-started/design-goals/\n\n",
    "img": "/img/C3_04-11-2025.png",
    "author": "Michal Koudela",
    "date": "2025-11-04"
  },
  {
    "title": "Výpadek služeb Amazon Web Services",
    "tldr": "Je cloud jedinou správnou cestou pro budoucnost, aneb co se stane, když vypadne jeden z největších cloudových poskytovatelů?",
    "text": "   Dne 20. října 2025, došlo v společnosti Amazon k výpadku cloudových služeb. Než budu pokračovat, tak bych měl krátce připomenout, co je to cloud. Cloud je typ služby, který běží na vzdáleném serveru a nikoliv u nás v našem počítači. Tento typ služeb je velice populární kvůli cenové dostupnosti a snažší správě. Nevýhodou, která je dnes více vidět, něž kdy jindy je závislost na internetu. A to ze strany naší i ze strany vzdáleného serveru.\n   Amazon Web Services jsou jedny z největších, pokud ne ty největší Cloudové služby na internetu. Běží na nich herní servery, internetové stránky, databáze, výpočetní servery a dokonce i některé státní služby. Když takovéto stránky vypadnou, pak se jedná o zaručenou katastrofu a finanční ztrátu pro všechny zúčastněné.\n   To mě přivádí k myšlence, kterou bych Vám zde chtěl sdělit. Ne vždy služby musí běžet v cloudu. Tento případ jasně ukazuje zranitelnost tohoto systému a závislost na třetí straně jako hrozbu pro obchod. Zároveň si však však myslím, že bychom neměli tuto technologii zatracovat. Zlehčuje životy mnoha vývojářům a Vám třeba zálohuje fotky za poměrně dobrou cenu.",
    "img": "/img/AWS_05-11-2025.png",
    "author": "Michal Koudela",
    "date": "2025-11-05"
  }
]